[
  {
    "id": 1,
    "image": "/img/blogs/blog-image-smarter.svg",
    "date": "October 11, 2019",
    "author": "Salau Ibrahim",
    "role": "Product Manager, TAMS",
    "read_time": "5 min read",
    "author_image": "/img/blogs/bromo.svg",
    "title": "Better, Smarter HRM for your organisation",
    "subtitle": "Introducing the new TAMS Website and Application",
    "content": "<article>\n  <p>We’re excited to unveil the <strong>brand new TAMS website</strong> — a reflection of the significantly improved TAMS application. This redesign delivers a clear message of our commitment to building top-tier <strong>time attendance</strong>, <strong>HR management</strong>, and <strong>payroll solutions</strong> that drive productivity and simplify workforce operations.</p>\n\n  <h2>What’s New on the Website?</h2>\n  <ul>\n    <li>✅ A <strong>clean, modern design</strong></li>\n    <li>✅ <strong>Streamlined navigation</strong> to help you find relevant information faster</li>\n    <li>✅ <strong>Improved menu functionality</strong> for easier access to key sections</li>\n    <li>✅ Fully <strong>responsive on all devices</strong>, ensuring seamless browsing on desktops, tablets, and mobile phones</li>\n    <li>✅ A dedicated section for <strong>TAMS application pricing</strong>, making it easier to understand our flexible subscription plans</li>\n  </ul>\n\n  <h2>Introducing TAMS 4.1</h2>\n  <p>Alongside our revamped website, we’re also proud to launch <strong>TAMS 4.1</strong> — the latest version of our application, packed with powerful enhancements:</p>\n\n  <ul>\n    <li>⚡ <strong>5X lighter & faster</strong> for improved performance</li>\n    <li>🌐 <strong>Unique company-branded URL</strong></li>\n    <li>🔐 <strong>Upgraded security features</strong></li>\n    <li>🖥️ <strong>Enhanced UI/UX</strong> for a more intuitive experience</li>\n    <li>📊 <strong>Insightful dashboards</strong> to monitor and manage HR operations</li>\n    <li>🔧 <strong>Modular structure</strong> — subscribe only to the features you need</li>\n    <li>🔍 <strong>Expanded functionality across all modules</strong></li>\n    <li>📈 <strong>Smarter reports and insights</strong> for optimized decision-making</li>\n  </ul>\n\n  <div style=\"margin: 2rem 0;\">\n    <img src=\"/img/blogs/blog-img-dashboard.svg\" alt=\"TAMS 4.1 Preview\" style=\"width: 100%; border-radius: 12px; box-shadow: 0 10px 20px rgba(0, 0, 0, 0.1);\" />\n  </div>\n\n  <h2>Stay Informed</h2>\n  <p>We’ll continue to keep you updated through our <strong>blogs</strong>, <strong>articles</strong>, and <strong>notifications</strong>. More product details will be added regularly to help you stay conversant with everything TAMS has to offer.</p>\n\n  <h2>Got Questions?</h2>\n  <p>If you have any questions about accessing the new TAMS application, don’t hesitate to reach out.</p>\n  <p>Email us at <a href=\"mailto:info@tams.com.ng\">info@tams.com.ng</a> — we’re happy to help!</p>\n\n  <p>👉 Visit <a href=\"https://www.tams.com.ng\" target=\"_blank\" rel=\"noopener noreferrer\">www.tams.com.ng</a> to explore the new experience!</p>\n</article>"
  },
  {
    "id": 2,
    "image": "/img/blogs/blog-2-1.svg",
    "date": "October 25, 2019",
    "author": "Salau Ibrahim",
    "role": "Product Manager, TAMS",
    "read_time": "5 min read",
    "author_image": "/img/blogs/bromo.svg",
    "title": "The Impact of Generational Gaps on Organisational Performance",
    "subtitle": "Understanding and ensuring productivity accross the different age groups in your organisation",
    "content": "<p>There is a growing need for organizations to pay attention to the differences in interests, values, work ethics, work styles and career expectations. With each new generation comes new demands from society, not to mention new expectations for companies and the workforce. Over time, the lack of attention to this pertinent issue has resulted in avoidable conflicts in most organizations in Nigeria.</p>\n\n<p>Because each generation has unique characteristics, things will likely not always be smooth sailing when the age gap reflects in workplace relations. As an employer, it can be very challenging to manage the expectations of multigenerational employees—each one has completely different expectations and priorities.</p>\n\n<p>However, understanding the potential challenges is the first step to solving them. In line with this, here are a few of the problems that can arise from multigenerational relations in a workplace:</p>\n\n<ul>\n  <li>Differences in the meaning of values and ethics</li>\n  <li>Divergent perceptions of and disposition to work</li>\n  <li>Communication gap and its inevitable risk of conflict</li>\n  <li>Conflict resolution styles which might result in lack of mutual understanding or even tolerance</li>\n</ul>\n\n<p><img src=\"/img/blogs/blog-2-2.svg\" alt=\"Workplace Generational Gap\" class=\"my-8 rounded-lg shadow-lg\" /></p>\n\n<p>As a result of these, productivity in the workplace could be hampered, hence there is every need for the management of the organization to be proactive about issues related to conflict before they escalate towards dissent.</p>\n\n<p>In that regard, generational gap frictions could be managed in the workplace through the following ways:</p>\n\n<ol>\n  <li>Company-wide or interdepartmental team bonding events to aid out-of-office interactions among team members.</li>\n  <li>Restructuring the workplace to reflect team spirit which would in turn foster healthy communication among team members.</li>\n  <li>Creating age-diverse projects which would cut across different generations.</li>\n  <li>Avoiding the delivery of judgments based on sentiment or stereotypes.</li>\n  <li>Cultivating an open communication style in the workplace to allow for idea generation and knowledge sharing among diverse generations.</li>\n</ol>\n\n<h3>Got Questions?</h3>\n<p>If you have any question at all about access to the new TAMS Application, please contact us at <a href=\"mailto:info@tams.com.ng\">info@tams.com.ng</a> — we're happy to help!</p>"
  },
  {
    "id": 3,
    "image": "/img/blogs/blog-3-1.svg",
    "date": "November 1, 2019",
    "author": "Salau Ibrahim",
    "role": "Product Manager, TAMS",
    "read_time": "4 min read",
    "author_image": "/img/blogs/bromo.svg",
    "title": "Enhancing employee performance through disruptive innovation",
    "subtitle": "Leveraging technology in the workplace to improve employees and organisational performance",
    "content": "<p>The world has become familiar with the impact of innovation in bringing about new ideas, creative thoughts and the application of better solutions in the form of devices or methods that meet new requirements, unarticulated needs or existing market needs. Beyond this sustaining innovation, however, is the concept of disruptive innovation, which “creates a new market by applying a different set of values, which ultimately (and unexpectedly) overtakes an existing market”.</p>\n\n<p>The difference between change and disruption is the level of impact. If you improve a product or service delivery to benefit customers, you have the makings of a successful business. If you want to disrupt your market, however, you need to create a solution or develop people that offer outstanding services to customers other than the norm.</p>\n\n<p>It is against that backdrop that we consider the perspective that human resources management has been taken to a totally new level as the world is going into a brilliant period of HR technology arrangements. Consequently, the fast-changing business environment along with the emergence of disruptive technology has placed an urgent demand on organisations and HR leaders to improve business performance through innovation and people. And it is on that account that dramatic innovations and improvements are required in bringing about organizational learning, leadership, people engagement, maintaining employee performance and retaining best-fit employees in the organization.</p>\n\n<p><img src=\"/img/blogs/blog-3-2.svg\" alt=\"Disruptive Innovation in HR\" class=\"my-8 rounded-lg shadow-lg\" /></p>\n\n<p>Below are a few learnings from Akshay Batra, managing director at Dr. Batra's Positive Health Clinic, and India's first trichologist (hair specialist) to be accepted into The Trichological Society of London.</p>\n\n<h4>1. Ensure you have the right culture fit.</h4>\n<p>Practically every employee is going to encounter a major shift or change at work at some point. Hence, skills must be relearned constantly, especially with fast-moving technology. The company will only thrive if employees are willing and eager to make those transitional shifts, despite the challenges. For instance, to give him the confidence that his team will adjust to whatever the future brings, Batra \"handpicks\" the doctors working in his clinics to ensure they embrace a culture of change.</p>\n\n<h4>2. Be a presence.</h4>\n<p>Employees can easily feel overwhelmed by a rapid onslaught of change. Ambiguity at the top makes the situation worse. Batra explained that he makes his presence known to his employees as a way to keep them moving forward. \"I lend myself to energize the team. In the healthcare system it is very important for everybody to be value driven, to understand the right direction, to make sure that the patients are kept at the top of everything we do,\" elaborated Batra. \"And of course to keep them energized.\"</p>\n\n<h4>3. Embrace technology.</h4>\n<p>Ironically, the best way to get employees to remove fear and develop technological skills is through the use of technology. Batra utilizes as many means of technology as he can get his hands on for communication, initial training and retraining. Among his different formats were webinars, group chats, emails and podcasts. \"They can be done very easily to reach out to people,\" he stated. From the foregoing, it is clear that disruptive technology isn’t a bad thing. There is unprecedented opportunity to break up hierarchies and allow greater empowerment so that people’s talents can be harnessed. Disappearance of routine tasks allows better network access, empowerment and analytics. Rapid changes will also give organisations and individuals the opportunity to enjoy a better future.</p>\n\n<h3>Got Questions?</h3>\n<p>If you have any question at all about access to the new TAMS Application, please contact us at <a href=\"mailto:info@tams.com.ng\">info@tams.com.ng</a> — we're happy to help!</p>"
  }
]
