[
  {
    "id": 1,
    "image": "/img/blogs/blog-20-1.jpg",
    "date": "October 11, 2019",
    "author": "Salau Ibrahim",
    "role": "Product Manager, TAMS",
    "read_time": "4 min read",
    "author_image": "/img/blogs/bromo.svg",
    "title": "Time Management Tips for Small Businesses ",
    "subtitle": "Running small businesses is hard, from organization administration to managing staff; selling products and services to taking care of customers...",
    "content": "<p>Running small businesses is hard, from organization administration to managing staff; selling products and services to taking care of customers; chasing leads, managing web and social media presence and the loads of other activities that are necessary for business owners to stay afloat. Looking at all the activities, it is sometimes hard to create time for other things!</p>\n\n<p>Unfortunately, there’s not a lot you can do about being busy. As a small business owner, you’re always going to have some packed schedules and until you reach the level of success where you can pay other people to do the heavy lifting for you. The best you can do is proper time management so you can pack as much productivity into the time you have as possible.</p>\n\n<p>Some of the best time management tips for small business owners that can be utilized to improve your organization processes. Hopefully, they’ll assist you and your business thrive through even the most hectic of working days.</p>\n\n<p><img src=\"/img/blogs/blog-20-2.jpg\" alt=\"Time Management Tips\" /></p>\n\n<h2>1. Set a schedule list for yourself and stick to it</h2>\n<p>Having a defined set goal and objective about how you accomplish your daily tasks at the workplace brings about productivity. Disorganization could lead to inefficiency and time-wasting. Organizing your time based on your current priorities and breaking down your tasks per hour or just creating a to-do list for the day would help in effective time structure.</p>\n<p>Designating each day to achieve one or two tasks would help. Maybe Mondays are for strategic meetings and reviews of last week’s activities. Tuesdays are for sales calls, Wednesday for invoicing and so on. Ensuring that tasks do not clash on a daily basis and whatsoever the case, ensure that there’s a structure you can stick to. Otherwise, you’re bound to spend as much time worrying over the next task to carry out.</p>\n\n<h2>2. Do not multitask</h2>\n<p>Doing different things simultaneously might seem like a smart way to save time, but it is overloading tasks on yourself in a short period of time. It will likely do more harm than good. Focusing on one task at a time improves productivity and performance. Conversely, trying to take care of a single task while you answer every new email, respond to every new text message, and micromanage every issue as it arises means you’re not giving anyone the necessary attention that they require.</p>\n<p>This means that you’ll likely have to go back and make corrections on tasks you rush doing as some careless errors might have come in place, it also means you’re wasting time at the moment by doing the same task over and over again. One thing at a time is always the best way to go.</p>\n\n<h2>3. Delegate</h2>\n<p>Work with people you can trust, and give them the leverage to work on tasks you don’t have time for or the tasks you don’t know how to accomplish. This will give you more time to focus on the tasks you’re best at. Sometimes, using interns and outsourcing to freelance contractors can make things happen.</p>\n\n<h2>4. Organize Your Space</h2>\n<p>“When your space is filled up with things you haven’t organized, all of those things are constantly ‘yelling’ at you,” said David Allen, a veteran productivity expert and creator of “Getting Things Done,” a work-life management method.</p>\n<p>When something catches your eye as you work (like a dirty coffee mug you want to clean or a paper that needs to be filed away), it may seem momentary and harmless. “But this drains your energy and focus, even if you don’t realize it,” said Allen, the author of \"Getting Things Done: The Art of Stress-Free Productivity.\"</p>\n\n<h2>5. Identify and get rid of your time wasters</h2>\n<p>Everyone has something that leads them to procrastination. Take steps to identify the time wasters as they might be very hard to notice. Once they have been identified, then try to cut them out of your day.</p>\n<p>If social media is a distraction for you, identify the app and uninstall or disable the apps. Disabling Notifications is also a good way to remove distractions. If you spend too much time answering emails, set a cap on the time you want to spend on emails on a daily basis.</p>\n\n<h2>6. Automate your processes</h2>\n<p>Recent technologies have made work easier and also offers numerous opportunities to streamline and optimize organization processes. With various applications, programs and online services, there are various ways technologies can handle them for you.</p>\n<p><strong>TAMS</strong>, a time attendance focused human resource solution has been designed to help organizations optimize their process. With the following features, TAMS allow organizations to manage their time effectively:</p>\n<ul>\n  <li>Track employees attendance with accurate reports</li>\n  <li>Automate shift for employees to track lateness and absenteeism</li>\n  <li>Automate payroll for seamless salary payment</li>\n  <li>Intuitive and interactive dashboard for swift decision making and many more…</li>\n</ul>\n\n<h3>Got Questions?</h3>\n<p>If you have any question at all about access to the new TAMS Application, please contact us at <a href=\"mailto:info@tams.com.ng\">info@tams.com.ng</a> — we're happy to help!</p>"
  },
  {
    "id": 2,
    "image": "/img/blogs/blog-18-1.jpg",
    "date": "March 6, 2020",
    "author": "Chinenye Nwadonu",
    "role": "Head, Business Development",
    "read_time": "3 min read",
    "author_image": "/img/blogs/chineye.jpg",
    "title": "How to Boost Employee Productivity with Corporate Benefits ",
    "subtitle": "The ﬁrst mention of beneﬁts in the corporate world is always understood from the aspect of ﬁnancial rewards and remunerations...",
    "content": "<h2>Corporate Benefits and Their Role in Boosting Employee Engagement</h2>\n\n<p>The first mention of benefits in the corporate world is always understood from the aspect of financial rewards and remunerations. However, the benefits to be derived span across a lot of frontiers, which all are geared towards the overall growth and improvement of the employee's personal and career development.</p>\n\n<p>Engagement enables the organization to determine how committed employees are to the company and helps in creating measures to increase the intensity levels of individuals to see the connection between their actions and the company’s objectives.</p>\n\n<p>In order to measure an employee's commitment, it is essential for the company to track and measure the following:</p>\n\n<ul>\n  <li>The levels of individual engagement</li>\n  <li>The level of energy expended in carrying out deliverables</li>\n  <li>The enablements created by improving work culture and doling out appreciation upon commendable results derived</li>\n</ul>\n\n<h3>Forms Corporate Benefits Can Take</h3>\n<p>To further expound on the role corporate benefits play in boosting engagement, it is important to note the following forms these benefits can assume:</p>\n\n<ul>\n  <li><strong>Adequate leave time</strong><br>This aids in replenishing employees' strength and energy.</li>\n  <li><strong>Profit sharing and company ownership</strong><br>This validates the employee's belief in shared ownership of the outcome of their actions and decisions at work.</li>\n  <li><strong>Training and development / Advanced Skill Building</strong><br>Knowing that an organization cares about your growth and development is a morale boost and reflects in work ethics and engagement.</li>\n  <li><strong>Remote / Flexible work schedules</strong><br>Considering urban stress and commute challenges, allowing for remote or flexible work can ease time spent in traffic and enhance concentration and productivity. While employers may have concerns about tracking productivity remotely, the benefits often outweigh the challenges.</li>\n  <li><strong>Improved work environments</strong><br>Proper work conditions boost creativity and productivity, making it a critical component of employee engagement.</li>\n</ul>\n\n<p>There is a need for the wellbeing of employees to hold a paramount position in the policies and decisions implemented by organizational management. The resultant effects of these initiatives are responsible for the overall growth and increased profitability of the company as a whole.</p>\n\n<p><strong>Got Questions?</strong></p>\n<p>If you have any question at all about access to the new TAMS Application, please contact us at <a href=\"mailto:info@tams.com.ng\">info@tams.com.ng</a> — we're happy to help!</p>"
  },
  {
    "id": 3,
    "image": "/img/blogs/blog-17-1.jpg",
    "date": "February 28, 2020",
    "author": "Thelma Ononye",
    "role": "Human Resources Manager, TAMS",
    "read_time": "6 min read",
    "author_image": "/img/blogs/thelma.png",
    "title": "Onboarding and Retention: How Can You Do It Best?",
    "subtitle": "Onboarding new employees is a crucial part of an employee’s life cycle. Onboarding can create a ‘make or break’ experience that translates...",
    "content": "<h2>Effective Onboarding for Employee Retention</h2>\n\n<p><em>Photo by Mabel Amber from Pexels</em></p>\n\n<p>Onboarding new employees is a crucial part of an employee’s life cycle. Onboarding can create a ‘make or break’ experience that translates to talent retention as well as return on investment (ROI). First impression matters. When welcoming new employees into the company, you have an opportunity to put your best foot forward and make an awesome lasting impression.</p>\n\n<p>According to research by Glassdoor, organizations with a strong onboarding process improve new hire retention by 82% and boost productivity by over 70%. The way employers handle a new employee’s first few days and weeks will determine if that employee will likely stay or leave the company before you spell “Jack”.</p>\n\n<p>According to Society for Human Resources Development (SHRM), employee onboarding (also known as organizational socialization) is the “process of helping new hires adjust to social and performance aspects of their new jobs quickly and smoothly, and learn the attitudes, knowledge, skills, and behaviors required to function effectively within an organization.” A standard onboarding program should extend between three months to one year to ensure they are supported as they rise to full productivity.</p>\n\n<img src=\"/img/blogs/blog-17-2.jpg\" alt=\"Onboarding New Employees\">\n\n<h3>Tactics to Improve Employee Retention</h3>\n\n<h4>A. Before Resumption Date:</h4>\n<p>Between the offer and start date is very important because the new joiner may still be interviewing with other companies and may change their minds.</p>\n<ol>\n  <li>Send a personalized card with company logo or an email expressing your excitement for their resumption.</li>\n  <li>Send a welcome pack which includes the company's mission, vision, culture, core values, background information, handbook, forms, parking info, and any other necessary materials.</li>\n  <li>Prepare a structured plan for HR and the Hiring Manager to partake in the onboarding program.</li>\n  <li>Set up the new joiner's workstation – computer, email, phone, ID cards, business cards, etc., and ensure everything works.</li>\n</ol>\n\n<h4>B. After Resumption Date:</h4>\n<ol>\n  <li>Introduce them to colleagues, office operations, benefits enrollment, company policies, and workplace “language.”</li>\n  <li>Clarify their roles, job descriptions, reporting lines, organizational charts, and who to ask questions.</li>\n  <li>Assign a “buddy” to help them feel comfortable, answer questions, and ease into the new culture.</li>\n  <li>Create opportunities for bonding and connection with coworkers.</li>\n  <li>Conduct regular check-ins and follow-ups to ensure they have what they need to succeed.</li>\n  <li>Foster trust within the team and with leadership.</li>\n  <li>Create proper communication channels for ease of interaction.</li>\n  <li>Set up early wins – provide goals with realistic expectations achievable within 3–6 months.</li>\n  <li>Offer continuous feedback – praise successes, provide constructive criticism, and encourage growth.</li>\n</ol>\n\n<h3>Conclusion</h3>\n<p>A very good onboarding offers a number of rewards for companies, especially employee retention. Many employees tend to exit the company within the first three to six months if not properly onboarded. Oftentimes, it’s the small things that make a huge difference in an employee’s perception. It only makes business sense to invest in onboarding.</p>\n\n<p><strong>Got Questions?</strong></p>\n<p>If you have any question at all about access to the new TAMS Application, please contact us at <a href=\"mailto:info@tams.com.ng\">info@tams.com.ng</a> — we're happy to help!</p>"
}
]
